app/controllers/essays_controller.rb

SELECT "essays".* FROM "essays"
---
	def index
		@essays = Essay.all

SELECT  "essays".* FROM "essays" WHERE "essays"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@essay = Essay.find(params[:id])

SELECT  "essays".* FROM "essays" WHERE "essays"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@essay = Essay.find(params[:id])

INSERT INTO "essays" ("title", "author", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Tyler"], ["author", "Best AUthor Ever"], ["text", "Best text ever"], ["created_at", "2016-01-20 19:51:04.981881"], ["updated_at", "2016-01-20 19:51:04.981881"]]
---
	def create
		@essay = Essay.new(essay_params)

		if @essay.save

SELECT  "essays".* FROM "essays" WHERE "essays"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "essays" SET "text" = ?, "updated_at" = ? WHERE "essays"."id" = ?  [["text", "Best text ever, EDITED"], ["updated_at", "2016-01-20 19:51:22.063848"], ["id", 1]]
---
	def update
		@essay = Essay.find(params[:id])

		if @essay.update(essay_params)